app/views/use_cases/_comment.html.haml

%div{:id=>"comment_show_#{use.id}"}
 -comments=use.comments.find :all
---
SELECT "comments".* FROM "comments" WHERE ("comments".use_case_id = 52)