app/views/requirements/_add_require.html.haml

SELECT "categories".* FROM "categories" WHERE (project_id=13)
---
                                                                                                                                                                                %span{:class=>"cols w180px"}=text_field_tag "name[#{f}]",'',:class=>"inpTxt w150px"
                                                                                                                                                                                %span{:class=>"cols w180px"}=select "category[#{f}]","",Category.find(:all,:conditions=>["project_id=?",session[:project_id]]).collect {|p| [p.title] },{},:class=>"inpSel1 w150px"