app/views/requirements/_comment.html.haml

SELECT "comments".* FROM "comments" WHERE ("comments".requirement_id = 57)
---
%div{:class=>"gap"}
-comments=req.comments.find :all