app/views/statics/_header.html.haml

SELECT "projects".* FROM "projects" WHERE (user_id=1)
---
  - if !current_user.nil?
    = select("project_name","project_id",Project.find(:all,:conditions=>["user_id=?",current_user.id]).collect {|p| [p.project_name,p.id] },{:selected=>session[:project_id]},{:class=>"customStyleSelectBox"})