app/views/project_files/_comment.html.haml

SELECT "comments".* FROM "comments" WHERE ("comments".project_file_id = 6)
---
%div{:id=>"comment_show_#{file1.id}"}
 -comments=file1.comments.find :all