app/views/project_files/_index.html.haml

SELECT * FROM "requirements" INNER JOIN "project_files_requirements" ON "requirements".id = "project_files_requirements".requirement_id WHERE ("project_files_requirements".project_file_id = 8 )
---
       |
       -if !f.requirements.empty?

SELECT * FROM "trackers" INNER JOIN "project_files_trackers" ON "trackers".id = "project_files_trackers".tracker_id WHERE ("project_files_trackers".project_file_id = 8 )
---
        ="UC"+f.use_cases[0].id.to_s
       -elsif !f.trackers.empty?