app/controllers/definitions_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 52 LIMIT 1
SELECT "definitions".* FROM "definitions" WHERE ("definitions".project_id = 52) ORDER BY term
---
  def index
     find_user
     assign_project_use
     @project=Project.find(session[:project_id])
     @defs=@project.definitions.find(:all,:order=>"term")

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 52 LIMIT 1
INSERT INTO "definitions" ("term", "definition", "project_id", "user_id", "member_id", "created_at", "updated_at") VALUES ('testterm', 'testdef', 52, 11, NULL, '2011-10-02 14:09:22.656250', '2011-10-02 14:09:22.656250')
SELECT "definitions".* FROM "definitions" WHERE ("definitions".project_id = 52) ORDER BY term
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
  def create_term
    @project=Project.find(session[:project_id])
    def1=params[:def]
    find_user
    if !@project.nil? and !current_user.nil?
      if !def1.eql?("<< Add definition")
         @term=@project.definitions.create(:term=>params[:term],:user_id=>@user.id,:definition=>params[:def])
      else
         @term=@project.definitions.create(:term=>params[:term],:user_id=>@user.id)
      end
    else
     if !@project.nil? and !current_member.nil? and !def1.eql?("<< Add definition")
      if !def1.eql?("<< Add definition")
         @term=@project.definitions.create(:term=>params[:term],:member_id=>@user.id,:user_id=>@user.user_id,:definition=>params[:def])
      else
         @term=@project.definitions.create(:term=>params[:term],:member_id=>@user.id,:user_id=>@user.user_id)
      end
     end

    end
    respond_to do |format|
      @defs=@project.definitions.find(:all,:order=>"term")

SELECT "definitions".* FROM "definitions" WHERE "definitions"."id" = 92 LIMIT 1
DELETE FROM "definitions" WHERE "definitions"."id" = 92
---
 def destroy_def
   @term=Definition.find(params[:id])
        if !@term.nil?
          @term.destroy

SELECT "definitions".* FROM "definitions" WHERE "definitions"."id" = 95 LIMIT 1
UPDATE "definitions" SET "term" = 'aaaaaxzcvsxvsxv ', "definition" = 'aaaaa', "updated_at" = '2011-10-02 16:36:57.578125' WHERE "definitions"."id" = 95
---
 def edit_def
     @term=Definition.find(params[:id])
     id=params[:id]
     @term.update_attributes(:term=>params[:"term_#{id}"],:definition=>params[:"definition_#{id}"])

SELECT "definitions".* FROM "definitions" WHERE (project_id='52' and term Like 'A%')
---
  def search_def
    find_user
    assign_project_use
    @defs=Definition.find(:all,:conditions=>["project_id=? and term ILIKE ?",session[:project_id],"#{params[:name]}%"])

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
  def find_user
        if !current_user.nil?
          @user=User.find(current_user.id)