app/controllers/homes_controller.rb

  def set_dismiss_dashboard_flag
    if !current_user.nil?
      user=User.find(current_user.id)
      user.update_attributes(:dismiss_dashboard=>true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "last_request_at" = '2012-04-17 08:16:53.682144', "perishable_token" = '1p672EU36p6KOn1Mb9rm', "updated_at" = '2012-04-17 08:16:53.682144' WHERE "users"."id" = 1

  def dashboard
    find_user
    if ((!current_user.nil? and current_user.dismiss_dashboard==false) or (!current_member.nil? and current_member.dismiss_dashboard==false))
      respond_to do |format|
        if session[:project_id].nil? and !current_user.nil?
          project=Project.assign_project_id(current_user.id)
          if !project.empty?
---
SELECT "projects".* FROM "projects" WHERE (user_id=1)

  def get_help
    @helps=Help.find :all
---
SELECT "helps".* FROM "helps"

  def find_all_attribute

    @project=Project.find(session[:project_id])
---
SELECT "projects".* FROM "projects" WHERE (user_id=1)