app/controllers/project_files_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 52 LIMIT 1
SELECT "project_files".* FROM "project_files" WHERE ("project_files".project_id = 52) ORDER BY created_at desc
---
  def index
    find_user
    assign_project
    @project=Project.find(session[:project_id])
    @files=@project.project_files.find(:all,:order => "created_at desc")

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 52 LIMIT 1
INSERT INTO "project_files" ("type1", "description", "user_id", "project_id", "member_id", "created_at", "updated_at", "file_file_name", "file_content_type", "file_file_size") VALUES (NULL, NULL, NULL, 52, NULL, '2011-10-02 14:36:56.328125', '2011-10-02 14:36:56.328125', 'projects.jpg', 'image/jpeg', 103711)
UPDATE "project_files" SET "user_id" = 11, "updated_at" = '2011-10-02 14:37:01.390625' WHERE "project_files"."id" = 6
UPDATE "users" SET "last_request_at" = '2011-10-02 14:37:01.281250', "perishable_token" = 'UF6ttJF0ZDZSjsRUSIHW', "updated_at" = '2011-10-02 14:37:01.281250' WHERE "users"."id" = 11
SELECT "user_plans".* FROM "user_plans" WHERE "user_plans"."user_id" = 11
UPDATE "user_plans" SET "storage" = 1954663, "updated_at" = '2011-10-02 14:37:01.671875' WHERE "user_plans"."id" = 22
---
  def create
    @project=Project.find(session[:project_id])
    @file = @project.project_files.create(params[:project_file])
    find_user
    if !current_user.nil?
       @file.update_attributes(:user_id=>@user.id)
    else
       @file.update_attributes(:user_id=>@user.user_id,:member_id=>@user.id)
    end
    user_plan=UserPlan.find_all_by_user_id(@file.user_id)
    user_plan[0].update_attributes(:storage=>user_plan[0].storage + @file.file_file_size)

SELECT "project_files".* FROM "project_files" WHERE "project_files"."id" = 7 LIMIT 1
DELETE FROM "project_files" WHERE "project_files"."id" = 7
SELECT "user_plans".* FROM "user_plans" WHERE "user_plans"."user_id" = 11 LIMIT 1
UPDATE "user_plans" SET "storage" = 1954663, "updated_at" = '2011-10-02 14:57:50.812500' WHERE "user_plans"."id" = 22
UPDATE "users" SET "last_request_at" = '2011-10-02 14:57:48.328125', "perishable_token" = '0dlQOzkAgUqJckqIeWz', "updated_at" = '2011-10-02 14:57:48.328125' WHERE "users"."id" = 11
---
  def destroy
    @file=ProjectFile.find(params[:id])
    find_user
    if !@file.nil?
      storage1=@file.file_file_size.to_i
      @file.file.destroy
      if !current_user.nil?
        user_plan=UserPlan.find_by_user_id(@user.id)
      else
        user_plan=UserPlan.find_by_user_id(@user.user_id)
      end
      @file.destroy
      user_plan.update_attributes(:storage=>user_plan.storage-storage1)

SELECT "project_files".* FROM "project_files" WHERE "project_files"."id" = 6 LIMIT 1
UPDATE "project_files" SET "type1" = 'cscsvs', "description" = 'scvsvsv', "updated_at" = '2011-10-02 17:17:51.765625' WHERE "project_files"."id" = 6
---
  def edit
    @file=ProjectFile.find(params[:id])

    if !@file.nil?
      @file.update_attributes(:type1=>params[:type],:description=>params[:des])

SELECT "project_files".* FROM "project_files" WHERE (file_file_name LIKE '3%' and project_id='52')
---
  def match_file_name

    file1=params[:char]
    @files=ProjectFile.find(:all,:conditions=>["file_file_name LIKE ? and project_id=?","#{file1}%",session[:project_id]])

SELECT "project_files".* FROM "project_files" WHERE (file_file_name LIKE 'projects.jpg')
SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = 57 LIMIT 1
---
  def create_link_req
    @file1=ProjectFile.find(:all,:conditions=>["file_file_name LIKE ?",params[:file_name].to_s+'.'+params[:ext1]])
    @req=Requirement.find(session[:req_id])

SELECT "project_files".* FROM "project_files" WHERE "project_files"."id" = 6 LIMIT 1
SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = 57 LIMIT 1
---
def destroy_file_req
    find_user
    @file=ProjectFile.find(params[:id])
    @req=Requirement.find(session[:req_id])

SELECT "project_files".* FROM "project_files" WHERE "project_files"."id" = 7 LIMIT 1
UPDATE "project_files" SET "description" = 'czczczcfedgedg', "updated_at" = '2011-10-02 17:36:35.187500' WHERE "project_files"."id" = 7
---
  def edit_file_req
    @file=ProjectFile.find(params[:id])
    find_user
     if !@file.nil?
      @file.update_attributes(:type1=>params[:type],:description=>params[:des])

SELECT "project_files".* FROM "project_files" WHERE (file_file_name LIKE 'i2_test_cases.xlsx')
SELECT "use_cases".* FROM "use_cases" WHERE "use_cases"."id" = 52 LIMIT 1
---
  def create_link_use
    @file1=ProjectFile.find(:all,:conditions=>["file_file_name LIKE ?",params[:file_name].to_s+'.'+params[:ext1]])
    @use=UseCase.find(session[:use_case_id])

SELECT "project_files".* FROM "project_files" WHERE "project_files"."id" = 6 LIMIT 1
UPDATE "project_files" SET "type1" = '', "description" = '', "updated_at" = '2011-10-02 17:37:49.359375' WHERE "project_files"."id" = 6
---
  def edit_file_use
    @file=ProjectFile.find(params[:id])
    find_user
     if !@file.nil?
      @file.update_attributes(:type1=>params[:type],:description=>params[:des])

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
       def find_user
         if !current_user.nil?
           @user=User.find(current_user.id)