app/controllers/requirements_controller.rb

SELECT "requirements".* FROM "requirements" WHERE (project_id='52') ORDER BY created_at desc
SELECT "attributes".* FROM "attributes" WHERE "attributes"."project_id" = 13 LIMIT 1
---
  def index
    find_user
    if !@user.nil?
      assign_project
      @requirements=Requirement.find(:all, :conditions=>["project_id=?", session[:project_id]], :order => "created_at desc")
      @attr=Attribute.find_by_project_id(session[:project_id])

UPDATE "requirements" SET "category" = 'ssss', "verification" = 'Test', "delivered" = 'zcxzvczxvxz', "updated_at" = '2012-04-17 12:37:12.838394' WHERE "requirements"."id" = 85
SELECT 1 FROM "requirements" WHERE "requirements"."project_id" = 13 AND ("requirements"."name" = 'xvxdvbdcb') AND ("requirements".id <> 85) LIMIT 1
---
  def edit

    status=@req.status
    find_user
    if !@user.nil?
      if ((status!="Approved" and params[:requirement][:status]=="Approved" and (@user.privilige=="Admin" or @user.privilige=="Approve" or @user.privilige=="Read/Write/Approve")) or (status!="Approved" and params[:requirement][:status]!="Approved" and (@user.privilige=="Admin" or @user.privilige=="Read/Write" or @user.privilige=="Read/Write/Approve" or @user.privilige=="Approve")) or (status=="Approved" and @user.privilige=="Admin")or (status=="Approved" and params[:requirement][:status]=="Approved" and !params[:requirement][:delivered].empty? and @user.privilige!="Read"))
        if @req.update_attributes(params[:requirement])
          if (!params[:requirement][:status].nil?)
            if (status!="Approved" and params[:requirement][:status]=="Approved")

              if !current_user.nil?
                first_name=@req.find_user_first_name(current_user.id)
                Requirement.notification_approved(current_user.id, @req.project_id, @req, first_name)
              else
                first_name=@req.find_member_first_name(@user.id)

SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = 57 LIMIT 1
---
  def show_tracker
    find_user
    if !@user.nil?
      assign_project
      @req = Requirement.find_by_id(params[:req])

SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = 57 LIMIT 1
SELECT "project_files".* FROM "project_files" WHERE "project_files"."id" = 7 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 52 LIMIT 1
---
  def show_file
    @req = Requirement.find_by_id(params[:req])
    find_user
    if !@user.nil?
      assign_project

      if !current_user.nil?
        @flag=check_storage(@user.id)
      else
        @flag=check_storage(@user.user_id)
      end
      @file_reqs=@req.project_files.find :all

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
  def find_user
    if !current_user.nil?
      @user=User.find(current_user.id)

SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = 85 LIMIT 1
---
  def load_object
    unless @req = Requirement.find_by_id(params[:id])