app/controllers/trackers_controller.rb

SELECT "trackers".* FROM "trackers" WHERE (project_id='52' and flag_tracker!='t') ORDER BY due
---
  def index
    find_user
    if !@user.nil?
      assign_project
      @trackers=Tracker.find_tracker(session[:project_id])

DELETE FROM "trackers" WHERE "trackers"."id" = 36
---
  def destroy
    find_user
    if !@user.nil?
      if (!@tracker.nil? and (@user.privilige=="Admin" or (!current_user.nil? and @user.id==@tracker.user_id) or (!current_member.nil? and @user.id==@tracker.member_id)))
        @tracker.destroy

SELECT "trackers".* FROM "trackers" WHERE (title LIKE 't%' and project_id='52')
---
  def match_tracker_name
    find_user
    if !@user.nil?
      assign_project
      tracker1=params[:char]
      @tracker=Tracker.find(:all, :conditions=>["title ILIKE ? and project_id=?", "#{tracker1}%", session[:project_id]])

SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = 57 LIMIT 1
---
  def create_tracker_req
    find_user
    if !@user.nil?
      if !session[:req_id].nil?
        @req=Requirement.find_by_id(session[:req_id])

UPDATE "trackers" SET "title" = 'test2tracker', "updated_at" = '2011-10-02 14:00:43.640625' WHERE "trackers"."id" = 36
SELECT addresses.first_name FROM "users" JOIN addresses on users.id=addresses.user_id
SELECT first_name FROM "members"
---
  def edit_tracker_req
    find_user
    if !@user.nil?
      tracker_assigned=@tracker.assigned
      if !@tracker.nil?
        date1=params[:due1].split('/')
        if !date1[1].nil?
          @tracker.update_attributes(:category=>params[:category][0], :due=>Date.strptime("{ #{date1[2]}, #{date1[0]}, #{date1[1]} }", "{ %Y, %m, %d }"), :assigned=>params[:assigned][:id], :assigned_subscriber_id=>@subscriber_id, :title=>params[:title])
        else
          @tracker.update_attributes(:category=>params[:category][0], :assigned=>params[:assigned][:id], :assigned_subscriber_id=>@subscriber_id, :title=>params[:title])
        end
        if (!params[:assigned][:id].empty?)
          if (tracker_assigned!=params[:assigned][:id])
            address=Address.find_by_first_name(params[:assigned][:id])
            if !address.nil?
              user=User.find(address.user_id)
              if !user.nil?
                first_name=address.first_name
                @notification=Notification.find(:all, :conditions=>["user_id=? and project_id=?", user.id, @tracker.project_id])
              end
            end

            if user.nil? and address.nil?
              user=Member.find_by_first_name((params[:assigned][:id]))
              if !user.nil?
                first_name=user.first_name

UPDATE "trackers" SET "title" = 'test2track', "updated_at" = '2011-10-02 13:59:59.062500' WHERE "trackers"."id" = 36
SELECT addresses.first_name FROM "users" JOIN addresses on users.id=addresses.user_id
SELECT first_name FROM "members"
---
  def edit_tracker_use
    find_user
    if !@user.nil?
      tracker_assigned=@tracker.assigned
      if !@tracker.nil?
        date1=params[:due1].split('/')
        if !date1[1].nil?
          @tracker.update_attributes(:category=>params[:category][0], :due=>Date.strptime("{ #{date1[2]}, #{date1[0]}, #{date1[1]} }", "{ %Y, %m, %d }"), :assigned=>params[:assigned][:id], :assigned_subscriber_id=>@subscriber_id, :title=>params[:title])
        else
          @tracker.update_attributes(:category=>params[:category][0], :assigned=>params[:assigned][:id], :assigned_subscriber_id=>@subscriber_id, :title=>params[:title])
        end
        if (!params[:assigned][:id].empty?)
          if (tracker_assigned!=params[:assigned][:id])
            address=Address.find_by_first_name(params[:assigned][:id])
            if !address.nil?
              user=User.find(address.user_id)
              if !user.nil?
                first_name=address.first_name
                @notification=Notification.find(:all, :conditions=>["user_id=? and project_id=?", user.id, @tracker.project_id])
              end
            end

            if user.nil? and address.nil?
              user=Member.find_by_first_name((params[:assigned][:id]))
              if !user.nil?
                first_name=user.first_name

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
SELECT "trackers".* FROM "trackers" WHERE "trackers"."id" = 36 LIMIT 1
---
  def find_user
    if !current_user.nil?
      @user=User.find(current_user.id)
      @all_user=Tracker.find_all_user(@user)