app/controllers/trackers_controller.rb

 def edit_tracker_req
     @requirement=Requirement.find(session[:req_id])
---
SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = 57 LIMIT 1