app/controllers/use_case_details_controller.rb

SELECT "pre_conditions".* FROM "pre_conditions" WHERE ("pre_conditions".use_case_id = 52) ORDER BY created_at desc
---
  def index
    show_conditions(params[:id])
    @pre_conditions=@use_case.pre_conditions.order("created_at desc")

SELECT "post_conditions".* FROM "post_conditions" WHERE ("post_conditions".use_case_id = 52) ORDER BY created_at desc
---
  def index_post_conditions
    show_conditions(params[:id])
    @post_conditions=@use_case.post_conditions.order("created_at desc")

SELECT "actors".* FROM "actors" WHERE ("actors".use_case_id = 52) ORDER BY created_at desc
---
  def index_actors
      show_conditions(params[:id])
      @actors=@use_case.actors.order("created_at desc")

SELECT "business_rules".* FROM "business_rules" WHERE ("business_rules".use_case_id = 52) ORDER BY created_at desc
---
  def index_business_rules
      show_conditions(params[:id])
      @business_rules=@use_case.business_rules.order("created_at desc")

SELECT "use_cases".* FROM "use_cases" WHERE "use_cases"."id" = 52 LIMIT 1
INSERT INTO "pre_conditions" ("title", "use_case_id", "created_at", "updated_at") VALUES ('cxzczc', 52, '2011-10-02 16:21:27.921875', '2011-10-02 16:21:27.921875')
---
  def create_pre_condition
    @use_case=UseCase.find(session[:use_case_id])
    #@use_case_details=@use_case.use_case_detail
    if !params[:pre].empty? and !@use_case.nil?
      @pre=@use_case.pre_conditions.create(:title=>params[:pre])

SELECT "pre_conditions".* FROM "pre_conditions" WHERE "pre_conditions"."id" = 75 LIMIT 1
DELETE FROM "pre_conditions" WHERE "pre_conditions"."id" = 75
---
  def delete_pre_condition
    @pre_condition=PreCondition.find(params[:value])
    if !@pre_condition.nil?
      @pre_condition.destroy

SELECT "pre_conditions".* FROM "pre_conditions" WHERE "pre_conditions"."id" = 76 LIMIT 1
UPDATE "pre_conditions" SET "title" = ' xz x x xzxczc', "updated_at" = '2011-10-02 16:25:25.546875' WHERE "pre_conditions"."id" = 76
---
  def edit_pre_condition
    @pre_condition=PreCondition.find(params[:id])
    id=params[:id]
    @pre_condition.update_attributes(:title=>params[:"pre_condition_#{id}"])

SELECT "use_cases".* FROM "use_cases" WHERE "use_cases"."id" = 52 LIMIT 1
INSERT INTO "post_conditions" ("title", "use_case_id", "created_at", "updated_at") VALUES ('zczcszc', 52, '2011-10-02 16:21:52.062500', '2011-10-02 16:21:52.062500')
---
  def create_post_condition
      @use_case=UseCase.find(session[:use_case_id])
      #@use_case_details=@use_case.use_case_detail
      if !params[:post].empty? and !@use_case.nil?
        @post=@use_case.post_conditions.create(:title=>params[:post])

SELECT "post_conditions".* FROM "post_conditions" WHERE "post_conditions"."id" = 7 LIMIT 1
DELETE FROM "post_conditions" WHERE "post_conditions"."id" = 7
---
    def delete_post_condition
      @post_condition=PostCondition.find(params[:value])
      if !@post_condition.nil?
        @post_condition.destroy

SELECT "use_cases".* FROM "use_cases" WHERE "use_cases"."id" = 52 LIMIT 1
INSERT INTO "business_rules" ("title", "use_case_id", "created_at", "updated_at") VALUES ('zcsc', 52, '2011-10-02 16:22:28.203125', '2011-10-02 16:22:28.203125')
---
   def create_business_rule
      @use_case=UseCase.find(session[:use_case_id])
      #@use_case_details=@use_case.use_case_detail
      if !params[:rule].empty? and !@use_case.nil?
        @rule=@use_case.business_rules.create(:title=>params[:rule])

SELECT "business_rules".* FROM "business_rules" WHERE "business_rules"."id" = 1 LIMIT 1
DELETE FROM "business_rules" WHERE "business_rules"."id" = 1
---
   def delete_business_rule
     @rule=BusinessRule.find(params[:id])
          if !@rule.nil?
            @rule.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
  def find_user
      if !current_user.nil?
        user=User.find(current_user.id)