app/controllers/use_cases_controller.rb

SELECT "post_conditions".* FROM "post_conditions" WHERE ("post_conditions".use_case_id = 52)
SELECT "use_cases".* FROM "use_cases" WHERE (project_id='52') ORDER BY created_at desc
---
  def index
      assign_project_use
      @user=find_user
      @use_cases=UseCase.find(:all,:conditions=>["project_id=?",session[:project_id]],:order => "created_at desc")

SELECT "use_cases".* FROM "use_cases" WHERE "use_cases"."id" = 52 LIMIT 1
---
  def show_tracker_use
      assign_project_use
      find_user
      use=UseCase.find(params[:use])

SELECT "use_cases".* FROM "use_cases" WHERE "use_cases"."id" = 52 LIMIT 1
SELECT "project_files".* FROM "project_files" WHERE "project_files"."id" = 6 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 52 LIMIT 1
---
  def show_file_use
      assign_project_use
      @user=find_user
      use=UseCase.find(params[:use])
      @file_uses=use.project_files.find :all

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
  def find_user
    if !current_user.nil?
      user=User.find(current_user.id)