app/controllers/user_sessions_controller.rb

  def create

    @user_session = UserSession.new(params[:user_session])
    @member_session=MemberSession.new(params[:user_session])
    @flag_error="false"
    @flag_active="false"
     @flag_subs="false"
    @user=User.find_by_email(params[:user_session][:email])
    @member=Member.find_by_email(params[:user_session][:email])
    if !@user.nil?
      @user_plan=UserPlan.find_by_user_id(@user.id)
      if @user_plan.status=="paypal-wait"
       client = CheddarGetter::Client.new(:product_code => "3D",
                                                 :username => "nikhil.verma@ongraph.com",
                                                 :password => "tester")

       response = client.get_customer(:code => @user.email)
       if !response.nil?
         status=response.customer_subscriptions[0][:cancelType]
         if status.nil?
           @user_plan.update_attributes(:status=>"Approved")
---
SELECT "users".* FROM "users" WHERE ("users".email LIKE 'aru@ongraph.com') LIMIT 1
SELECT "members".* FROM "members" WHERE ("members".email LIKE 'patrick.bowe@gmail.com') LIMIT 1
SELECT "user_plans".* FROM "user_plans" WHERE "user_plans"."user_id" = 1 LIMIT 1
UPDATE "users" SET "login_count" = 122, "last_login_at" = '2012-04-16 10:37:53.593750', "current_login_at" = '2012-04-16 10:45:28.312500', "last_request_at" = '2012-04-16 10:45:28.312500', "perishable_token" = 'EnlFiqFmzYQA0Axps8J', "updated_at" = '2012-04-16 10:45:28.312500' WHERE "users"."id" = 1