app/views/trackers/_comment.html.haml

SELECT "comments".* FROM "comments" WHERE ("comments".tracker_id = 36)
---
%div{:id=>"comment_show_#{tracker.id}"}
 -comments=tracker.comments.find :all